#Область ПрограммныйИнтерфейс

Процедура ВКМ_ТГУведомление() Экспорт
	
	HTTPСоединение = Новый HTTPСоединение("api.telegram.org", 443, , , , , Новый ЗащищенноеСоединениеOpenSSL);	
	
	ДанныеДляЗапроса = "/bot" + Константы.ВКМ_ТокенУправленияТелеграмБотом.Получить() + "/sendMessage";
	HTTPЗапрос = Новый HTTPЗапрос(ДанныеДляЗапроса);
	
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json");
		
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_УведомленияТелеграмБоту.ТекстСообщения КАК ТекстСообщения,
		|	ВКМ_УведомленияТелеграмБоту.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ИдентиффикаторГруппы = Константы.ВКМ_ИдентификаторГруппыТГ.Получить();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Сообщение = Новый Структура;
		Сообщение.Вставить("chat_id", ИдентиффикаторГруппы);
		Сообщение.Вставить("text", ВыборкаДетальныеЗаписи.ТекстСообщения);
		
		ЗаписьJson = новый ЗаписьJSON;
		ЗаписьJson.УстановитьСтроку();
		ЗаписатьJson(ЗаписьJson, Сообщение);
		СтрокаJSON = ЗаписьJson.Закрыть();
		
		HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаJSON);
		
		Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
		
		Если Ответ.КодСостояния = 200 Тогда
			ДокОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			ДокОбъект.Удалить();
		Иначе
			СообщениеОшибки = СтрШаблон("Ошибка при отправке сообщения в телеграм-бот. Код ошибки:%1", Ответ.КодСостояния);
			ЗаписьЖурналаРегистрации("HTTPСервисы.Ошибка", 
        	УровеньЖурналаРегистрации.Ошибка, , ,
        	СообщениеОшибки);
		КонецЕсли;	

	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти