#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВидимостьРеквизитовОтВидаДоговора();	

КонецПроцедуры

&НаКлиенте
Процедура КатегорияСотрудникаПриИзменении(Элемент)
	
	ВидимостьРеквизитовОтВидаДоговора();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВидимостьРеквизитовОтВидаДоговора()
	
	Если Запись.КатегорияСотрудника = ПредопределенноеЗначение("Справочник.ВКМ_КатегорииСотрудников.Специалист") Тогда
		
		Элементы.Оклад.Видимость = Ложь;
		Элементы.ПроцентОтРабот.Видимость = Истина;
		
	Иначе
		
		Элементы.Оклад.Видимость = Истина;
		Элементы.ПроцентОтРабот.Видимость = Ложь;
			
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти