
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//КоличествоДнейОтпуска();
	УстановитьДлительность();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	//КоличествоДнейОтпуска();
	УстановитьДлительность();
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	//КоличествоДнейОтпуска();
	УстановитьДлительность();
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковПриАктивизацииСтроки(Элемент)
	
	МассивСотрудников = ПолучитьКоличествоДнейОтпуска();
	
	Строка = Элемент.ТекущиеДанные;
	
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если МассивСотрудников.Найти(Строка.Сотрудник) <> Неопределено Тогда
			
			Элемент.ЦветФона = WebЦвета.Красный;
			
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура АнализГрафика(Команда)
	
	АдресВХранилище = ПоместитьВоВременноеХранилищеНаСервере();
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресВХранилище", АдресВХранилище);
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПоместитьВоВременноеХранилищеНаСервере()

	Адрес = ПоместитьВоВременноеХранилище(Объект.ОтпускаСотрудников.Выгрузить( , "Сотрудник, ДатаНачала, ДатаОкончания"), );
	Возврат Адрес;
	
КонецФункции

&НаКлиенте
Процедура КоличествоДнейОтпуска()
	
	МассивСотрудников = ПолучитьКоличествоДнейОтпуска();
	ИзменитьОформлениеСтрок(МассивСотрудников);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКоличествоДнейОтпуска()
	
	МассивСотрудников = Новый Массив;
		
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник КАК Сотрудник,
		|	СУММА(РАЗНОСТЬДАТ(ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания,
		|		ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала, ДЕНЬ) + 1) КАК КоличествоДнейОтпуска
		|ИЗ
		|	Документ.ВКМ_ГрафикОтпусков.ОтпускаСотрудников КАК ВКМ_ГрафикОтпусковОтпускаСотрудников
		|ГДЕ
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.КоличествоДнейОтпуска > 28 Тогда
			
			МассивСотрудников.Добавить(ВыборкаДетальныеЗаписи.Сотрудник);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивСотрудников;
	
КонецФункции

&НаКлиенте
Процедура ИзменитьОформлениеСтрок(МассивСторудников)

	Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл
		
        Если МассивСторудников.Найти(Строка.Сотрудник) <> Неопределено Тогда
			
			Строка.Длительность = 999;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДлительность()
	
	Для Каждого Стр Из Объект.ОтпускаСотрудников Цикл
		
		Если (Стр.ДатаОкончания - Стр.ДатаНачала)/86400 + 1 > 28 Тогда
			
			Стр.Длительность = (Стр.ДатаОкончания - Стр.ДатаНачала)/86400 + 1;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти



