#Область ПрограммныйИнтерфейс

Функция ПолучитьДанныеДлятаблицы(ПериодОбработки) Экспорт
			
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
			|ГДЕ
			|	ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание)";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Договора = Новый Массив;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Договора.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
			
		КонецЦикла;
		
		НачалоМесяца = ПериодОбработки.ДатаНачала;
		КонецМесяца = ПериодОбработки.ДатаОкончания;
		
		ТаблицаРезультата = Новый Массив();
		
		Для Каждого Договор Из Договора Цикл
				
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	РеализацияТоваровУслуг.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
			|ГДЕ
			|	РеализацияТоваровУслуг.Договор = &Договор
			|	И РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания";
		
		Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца);
		Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца);
		Запрос.УстановитьПараметр("Договор", Договор);
		
		РезультатЗапроса = Запрос.Выполнить().Выбрать();
		
		Если РезультатЗапроса.Следующий() Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Реализация  = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		Реализация.Дата = НачалоМесяца;
		Реализация.Договор = Договор;
		Реализация.Контрагент = Договор.Владелец;
		Реализация.Организация = Справочники.Организации.НайтиПоНаименованию("Организация для проверки");
		Реализация.СуммаДокумента = 1234567689;
		Реализация.Основание = Документы.ЗаказПокупателя.НайтиПоНомеру(123);
		
		Реализация.ВыполнитьАвтозаполнение();
		
		Если Не Реализация.ПроверитьЗаполнение() Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Реализация.Записать(РежимЗаписиДокумента.Проведение);
		
		СтруктурТаблицы = Новый Структура;
		СтруктурТаблицы.Вставить("Договор", Договор);
		СтруктурТаблицы.Вставить("Реализация", Реализация.Ссылка);
		
		ТаблицаРезультата.Добавить(СтруктурТаблицы);
		
		КонецЦикла;
		
		Возврат ТаблицаРезультата;
	
КонецФункции

#КонецОбласти