
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Адрес = Параметры.АдресВХранилище;
	
	ОтпускаСотрудников = ПолучитьИзВременногоХранилища(Адрес);
	
	МинДата = Неопределено;
	МаксДата = Неопределено;
	
	Для Каждого Строка Из ОтпускаСотрудников Цикл
		
		Если МинДата = Неопределено ИЛИ Строка.ДатаНачала < МинДата Тогда
			МинДата = Строка.ДатаНачала;
		КонецЕсли;
			
		Если МаксДата = Неопределено ИЛИ Строка.ДатаОкончания > МаксДата Тогда
			МаксДата = Строка.ДатаОкончания;
		КонецЕсли;	
		
	КонецЦикла;
	
	ДиаграммаГанта.Обновление = Ложь;
	ДиаграммаГанта.Очистить();
	
//	ДиаграммаГанта.НачалоПолногоИнтервала = МинДата;
//	ДиаграммаГанта.КонецПолногоИнтервала = МаксДата;
	
	ДиаграммаГанта.АвтоОпределениеПолногоИнтервала = Ложь;
	ДиаграммаГанта.УстановитьПолныйИнтервал(МинДата, КонецДня(МаксДата));
		
	СерияОтпуск = ДиаграммаГанта.Серии.Добавить();
	СерияОтпуск.Текст = "Отпуск";
	
	Для Каждого Строка Из ОтпускаСотрудников Цикл
	
//		Точка = ДиаграммаГанта.УстановитьТочку(Строка.Сотрудник);
//		Серия = ДиаграммаГанта.УстановитьСерию("Отпуск");
//		
//		Значение = ДиаграммаГанта.ПолучитьЗначение(Точка, Серия);
//		Интервал = значение.Добавить();
//		Интервал.Начало = Строка.ДатаНачала;
//		Интервал.Конец = СТрока.ДатаОкончания;
		
		ТочкаСотрудник = ДиаграммаГанта.Точки.Добавить();
		ТочкаСотрудник.Текст = Строка.Сотрудник;
		
		Значение = ДиаграммаГанта.ПолучитьЗначение(ТочкаСотрудник, СерияОтпуск);
		
		Интервал = Значение.Добавить();
		Интервал.Начало = Дата(Строка.ДатаНачала);
		Интервал.Конец = Дата(Строка.ДатаОкончания);
			
	КонецЦикла;
	
	ДиаграммаГанта.Обновление = Истина;
	 
КонецПроцедуры

#КонецОбласти