
#Область ОбработчикиСобытийЭлементовТаблицыФормыНачисления

&НаКлиенте
Процедура НачисленияСотрудникПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Начисления.ТекущиеДанные;
	
	ЭтоСпециалист = ПроверитьЭтоСпециалист(ТекущиеДанные.Сотрудник);
	
	Если ЭтоСпециалист Тогда
		
		ТекущиеДанные.КатегорияСотрудника = ПредопределенноеЗначение("Справочник.ВКМ_КатегорииСотрудников.Специалист");		

	Иначе
		
		ТекущиеДанные.КатегорияСотрудника = ПредопределенноеЗначение("Справочник.ВКМ_КатегорииСотрудников.АдминистративныйПерсонал");
		
	КонецЕсли;		
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПроверитьЭтоСпециалист(Сотрудник)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник КАК Сотрудник
		|ИЗ
		|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Период, Сотрудник = &Сотрудник
		|	И КатегорияСотрудника = &КатегорияСотрудника) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Период", Объект.Дата);
	Запрос.УстановитьПараметр("КатегорияСотрудника", Справочники.ВКМ_КатегорииСотрудников.Специалист);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;

	КонецЕсли;
	
КонецФункции

#КонецОбласти