#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВидимостьРеквизитовОтВидаДоговора();	

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
		ЭлементДатаНачалаДоговора = ЭтотОбъект.Элементы.Добавить("НачалоДействияДоговора", Тип("ПолеФормы"));
		ЭлементДатаНачалаДоговора.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементДатаНачалаДоговора.ПутьКДанным = "Объект.ВКМ_НачалоДействияДоговора";
		
		ЭлементДатаНачалаДоговора = ЭтотОбъект.Элементы.Добавить("КонецДействияДоговора", Тип("ПолеФормы"));
		ЭлементДатаНачалаДоговора.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементДатаНачалаДоговора.ПутьКДанным = "Объект.ВКМ_КонецДействияДоговора";
		
		ЭлементДатаНачалаДоговора = ЭтотОбъект.Элементы.Добавить("СуммаАбонентскойПлаты", Тип("ПолеФормы"));
		ЭлементДатаНачалаДоговора.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементДатаНачалаДоговора.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
		
		ЭлементДатаНачалаДоговора = ЭтотОбъект.Элементы.Добавить("СтоимостьЧасаРаботы", Тип("ПолеФормы"));
		ЭлементДатаНачалаДоговора.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементДатаНачалаДоговора.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
				
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	ВидимостьРеквизитовОтВидаДоговора();	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВидимостьРеквизитовОтВидаДоговора()
	
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		
		Элементы.НачалоДействияДоговора.Видимость = Истина;
		Элементы.КонецДействияДоговора.Видимость = Истина;
		Элементы.СуммаАбонентскойПлаты.Видимость = Истина;
		Элементы.СтоимостьЧасаРаботы.Видимость = Истина;
		
	Иначе
		
		Элементы.НачалоДействияДоговора.Видимость = Ложь;
		Элементы.КонецДействияДоговора.Видимость = Ложь;
		Элементы.СуммаАбонентскойПлаты.Видимость = Ложь;
		Элементы.СтоимостьЧасаРаботы.Видимость = Ложь;
			
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти