
#Область ОбработчикиКомандФормы
	
&НаСервере
Функция ЗаполнитьНаСервере()

	 ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
     Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, "Обработки.ВКМ_МассовоеСозданиеАктов.ПолучитьДанныеДлятаблицы", 
      Объект.Период);

КонецФункции

&НаКлиенте
Процедура Заполнить(Команда)
	
	 ДлительнаяОперация = ЗаполнитьНаСервере();
     ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
     ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультат", ЭтотОбъект);
     ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
     
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультат(Результат, ДополнительныеПараметры) Экспорт
	
     Если Результат = Неопределено Тогда
     	
     	Возврат;
      
     КонецЕсли;
     
     ДанныеТЧ = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
     
     Если ДанныеТЧ = Неопределено Тогда
     	Возврат;
     КонецЕсли;
     
     Для Каждого Строка Из ДанныеТЧ Цикл
     	
     	СтрокаТЧ = Объект.Договоры.Добавить();
		СтрокаТЧ.Договор = Строка.Договор;
		СтрокаТЧ.Реализация = Строка.Реализация;
     	
     КонецЦикла;
     
     Элементы.Договоры.Обновить();
     
КонецПроцедуры

#КонецОбласти






















